In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("data.csv")

In [3]:
df

,Unnamed: 0,Address,Zip,Price,Area,Room,Lon,Lat
0,1,"Blasiusstraat 8 2, Amsterdam",1091 CR,685000.0,64,3,4.907736,52.356157
1,2,"Kromme Leimuidenstraat 13 H, Amsterdam",1059 EL,475000.0,60,3,4.850476,52.348586
2,3,"Zaaiersweg 11 A, Amsterdam",1097 SM,850000.0,109,4,4.944774,52.343782
3,4,"Tenerifestraat 40, Amsterdam",1060 TH,580000.0,128,6,4.789928,52.343712
4,5,"Winterjanpad 21, Amsterdam",1036 KN,720000.0,138,5,4.902503,52.410538
...,...,...,...,...,...,...,...,...
919,920,"Ringdijk, Amsterdam",1097 AE,750000.0,117,1,4.927757,52.354173
920,921,"Kleine Beerstraat 31, Amsterdam",1033 CP,350000.0,72,3,4.890612,52.414587
921,922,"Stuyvesantstraat 33 II, Amsterdam",1058 AK,350000.0,51,3,4.856935,52.363256
922,923,"John Blankensteinstraat 51, Amsterdam",1095 MB,599000.0,113,4,4.965731,52.375268
923,924,"S. F. van Ossstraat 334, Amsterdam",1068 JS,300000.0,79,4,4.810678,52.355493

In [4]:
df=df[['Area','Room','Price']]

In [5]:
df

     Area  Room     Price
0      64     3  685000.0
1      60     3  475000.0
2     109     4  850000.0
3     128     6  580000.0
4     138     5  720000.0
..    ...   ...       ...
919   117     1  750000.0
920    72     3  350000.0
921    51     3  350000.0
922   113     4  599000.0
923    79     4  300000.0

[924 rows x 3 columns]

In [6]:
df.isna().any()

Area     False
Room     False
Price     True
dtype: bool

In [7]:
df.isna().sum()

Area     0
Room     0
Price    4
dtype: int64

In [8]:
df.describe()

             Area        Room         Price
count  924.000000  924.000000  9.200000e+02
mean    95.952381    3.571429  6.220654e+05
std     57.447436    1.592332  5.389942e+05
min     21.000000    1.000000  1.750000e+05
25%     60.750000    3.000000  3.500000e+05
50%     83.000000    3.000000  4.670000e+05
75%    113.000000    4.000000  7.000000e+05
max    623.000000   14.000000  5.950000e+06

In [9]:
df=df.dropna()

In [10]:
df.isna().any()

Area     False
Room     False
Price    False
dtype: bool

In [11]:
x=df[['Area','Room']]

In [12]:
y=df[['Price']]

In [13]:
x

     Area  Room
0      64     3
1      60     3
2     109     4
3     128     6
4     138     5
..    ...   ...
919   117     1
920    72     3
921    51     3
922   113     4
923    79     4

[920 rows x 2 columns]

In [14]:
y

        Price
0    685000.0
1    475000.0
2    850000.0
3    580000.0
4    720000.0
..        ...
919  750000.0
920  350000.0
921  350000.0
922  599000.0
923  300000.0

[920 rows x 1 columns]

In [15]:
from sklearn.model_selection import train_test_split

In [16]:
X_train,X_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

In [17]:
X_train

     Area  Room
698    81     3
771    74     4
682    79     3
738    64     2
464    49     3
..    ...   ...
275    85     4
383    71     3
238   151     3
85     32     1
184   183     4

[736 rows x 2 columns]

In [18]:
X_test

     Area  Room
646   149     3
205    85     3
900    21     1
832    60     2
720    81     4
..    ...   ...
451    69     4
606   106     3
506    75     3
423   136     5
529    45     2

[184 rows x 2 columns]

In [19]:
y_train

         Price
698   275000.0
771   350000.0
682   475000.0
738   450000.0
464   360000.0
..         ...
275   275000.0
383   245000.0
238   999500.0
85    225000.0
184  2475000.0

[736 rows x 1 columns]

In [21]:
from sklearn.linear_model import LinearRegression

In [22]:
model=LinearRegression()

In [23]:
model.fit(X_train,y_train)

LinearRegression()

In [26]:
model.predict([[70,3]])

c:\users\avi\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[415999.41880553]])

In [27]:
model.predict([[89,4]])

c:\users\avi\appdata\local\programs\python\python39\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[539536.38275951]])

In [28]:
model.score(X_test,y_test)

0.7939043369070353

In [29]:
from sklearn.linear_model import LogisticRegression

In [30]:
mod=LogisticRegression()

In [31]:
mod.fit(X_train,y_train)

c:\users\avi\appdata\local\programs\python\python39\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
c:\users\avi\appdata\local\programs\python\python39\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [32]:
mod.score(X_test,y_test)

0.05434782608695652